In [1]:
import pandas as pd

<h3>Feed pd.read_csv() Method a URL Argument</h3>

In [4]:
url = 'https://data.cityofnewyork.us/api/views/25th-nujf/rows.csv?accessType=DOWNLOAD'
baby_names = pd.read_csv(url)

In [5]:
baby_names.head()

   Year of Birth  Gender Ethnicity Child's First Name  Count  Rank
0           2011  FEMALE  HISPANIC          GERALDINE     13    75
1           2011  FEMALE  HISPANIC                GIA     21    67
2           2011  FEMALE  HISPANIC             GIANNA     49    42
3           2011  FEMALE  HISPANIC            GISELLE     38    51
4           2011  FEMALE  HISPANIC              GRACE     36    53

In [6]:
baby_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19418 entries, 0 to 19417
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Year of Birth       19418 non-null  int64
 1   Gender              19418 non-null  object
 2   Ethnicity           19418 non-null  object
 3   Child's First Name  19418 non-null  object
 4   Count               19418 non-null  int64
 5   Rank                19418 non-null  int64
dtypes: int64(3), object(3)
memory usage: 910.3+ KB

<h3>Quick Object Conversions</h3>

In [9]:
#Pandas Series to Python List
baby_names["Child\'s First Name"].tolist()
baby_names["Child\'s First Name"].to_frame().head()

  Child's First Name
0          GERALDINE
1                GIA
2             GIANNA
3            GISELLE
4              GRACE

In [11]:
", ".join(str(name) for name in baby_names["Child\'s First Name"])

output= None

<h3>Export DataFrame to CSV File with the .to_csv() Method</h3>

In [13]:
baby_names.to_csv('resources/NYC Baby Names.csv', index=False,encoding='utf-8')

# index=False -> drop the index column
# columns -> you can save selected columns only

<h3>Install xlrd and openpyxl Libraries to Read and Write Excel Files</h3>

In [14]:
# !conda install xlrd

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.

In [15]:
# !conda install openpyxl

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.

<h3>Import Excel File into pandas</h3>

In [16]:
pd.read_excel('resources/Data - Single Worksheet.xlsx')

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [17]:
pd.read_excel('resources/Data - Multiple Worksheets.xlsx') 
# Imports 1st sheet in a workbook

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [18]:
pd.read_excel('resources/Data - Multiple Worksheets.xlsx', sheet_name='Data 2')

  First Name Last Name           City Gender
0     Parker     Power        Raleigh      F
1    Preston  Prescott   Philadelphia      F
2    Ronaldo   Donaldo         Bangor      M
3      Megan   Stiller  San Francisco      M
4     Bustin    Jieber         Austin      F

In [26]:
data_ = pd.read_excel('resources/Data - Multiple Worksheets.xlsx', sheet_name=['Data 1', 'Data 2'])
# returns Dictionary
data_

{'Data 1':   First Name Last Name           City Gender
 0    Brandon     James          Miami      M
 1       Sean   Hawkins         Denver      M
 2       Judy       Day    Los Angeles      F
 3     Ashley      Ruiz  San Francisco      F
 4  Stephanie     Gomez       Portland      F,
 'Data 2':   First Name Last Name           City Gender
 0     Parker     Power        Raleigh      F
 1    Preston  Prescott   Philadelphia      F
 2    Ronaldo   Donaldo         Bangor      M
 3      Megan   Stiller  San Francisco      M
 4     Bustin    Jieber         Austin      F}

In [27]:
data = pd.read_excel('resources/Data - Multiple Worksheets.xlsx', sheet_name=[0,1])
# returns Dictionary
data

{0:   First Name Last Name           City Gender
 0    Brandon     James          Miami      M
 1       Sean   Hawkins         Denver      M
 2       Judy       Day    Los Angeles      F
 3     Ashley      Ruiz  San Francisco      F
 4  Stephanie     Gomez       Portland      F,
 1:   First Name Last Name           City Gender
 0     Parker     Power        Raleigh      F
 1    Preston  Prescott   Philadelphia      F
 2    Ronaldo   Donaldo         Bangor      M
 3      Megan   Stiller  San Francisco      M
 4     Bustin    Jieber         Austin      F}

In [22]:
type(data)

dict

In [23]:
data[0]

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [24]:
data[1]

  First Name Last Name           City Gender
0     Parker     Power        Raleigh      F
1    Preston  Prescott   Philadelphia      F
2    Ronaldo   Donaldo         Bangor      M
3      Megan   Stiller  San Francisco      M
4     Bustin    Jieber         Austin      F

In [28]:
data_['Data 1']

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [29]:
data_['Data 2']

  First Name Last Name           City Gender
0     Parker     Power        Raleigh      F
1    Preston  Prescott   Philadelphia      F
2    Ronaldo   Donaldo         Bangor      M
3      Megan   Stiller  San Francisco      M
4     Bustin    Jieber         Austin      F

In [30]:
pd.read_excel('resources/Data - Multiple Worksheets.xlsx', sheet_name=None)

{'Data 1':   First Name Last Name           City Gender
 0    Brandon     James          Miami      M
 1       Sean   Hawkins         Denver      M
 2       Judy       Day    Los Angeles      F
 3     Ashley      Ruiz  San Francisco      F
 4  Stephanie     Gomez       Portland      F,
 'Data 2':   First Name Last Name           City Gender
 0     Parker     Power        Raleigh      F
 1    Preston  Prescott   Philadelphia      F
 2    Ronaldo   Donaldo         Bangor      M
 3      Megan   Stiller  San Francisco      M
 4     Bustin    Jieber         Austin      F}

<h3>Export Excel File</h3>

In [31]:
girls = baby_names[baby_names['Gender']=='FEMALE']
boys = baby_names[baby_names['Gender']=='MALE']

In [36]:
excel_file = pd.ExcelWriter("resources/Baby Names.xlsx")

In [37]:
girls.to_excel(excel_writer=excel_file, sheet_name="Girls", index=False)
boys.to_excel(excel_writer=excel_file, sheet_name="Boys", index=False)

In [38]:
excel_file.save()